{
	"What I'm currently up to...": [
		{
			"title": "Machine Learning @ Berkeley Research and External Officer",
			"description": "planning hackathons, career fairs, workshops, and more with Machine Learning @ Berkeley, UC Berkeley's premier machine learning organization"
		},
		{
			"title": "Research Assistant at Stanford AI Laboratory and Berkeley AI Research",
			"description": "investigating how frontier AI agents will shape the future of cybersecurity under the guidance of Professor Dawn Song"
		},
		{
			"title": "Uber SWE Intern",
			"description": "building GenAI tools and backend infrastructure for the AI Solutions team"
		},
		{
			"title": "CS 189/289 Teaching Assistant",
			"description": "teaching CS 189/289 (Introduction to Machine Learning) in Fall 2025"
		}
	],
	"Experience": [
		{
			"title": "VectorShift Software Engineering Intern",
			"description": "implemented LLMOps evaluations platform and revamped marketplace, spurring a 230% growth in daily active users over a month"
		},
		{
			"title": "Project Manager for Venture Strategy Solutions/Power My Analytics",
			"description": "led a team of 7 consultants to implement an AI coding agent with a test-driven ReAct approach to accelerate the development of new 3rd-party connectors for Power My Analytics"
		},
		{
			"title": "Software Developer for Blueprint/Alliance for Clean Energy New York",
			"description": "built and deployed an automated webscraper on Google Cloud to collect information on over 2,000 renewable energy projects in New York for a public web app with a searchable map, filters, and data aggregation"
		},
		{
			"title": "Berkeley SkyDeck Technical Intern",
			"description": "automated 250+ office hour sign-ups, mentor matchings, and event RSVPs using scripts to save 80+ hours/week for program admins"
		},
		{
			"title": "Consultant for Venture Strategy Solutions/BetterUp",
			"description": "coded an auditing dashboard to extract data on 600 courses and provide LLM-powered insights for improving learner outcomes for 4,000+ coaches"
		}
	],
	"Projects": [
		{
			"title": "AI-SL",
			"description": "For the 2025 AI Hackathon at Berkeley, I built a web app and chrome extension that turns natural language English into custom ASL animations. We used a LLM to convert English into ASL gloss, encoded the ASL tokens for similarity lookup in a vector DB, then used MediaPipe to turn clips of humans signing ASL into a continuous video with a customized bear avatar. You can try out the backend API of our app on HuggingFace!",
			"link": "https://huggingface.co/spaces/deenasun/ai-sl-api",
			"image": "/bear.png",
			"github": "https://github.com/deenasun/ai-sl"
		},
		{
			"title": "Guesscasso",
			"description": "A funky spin on skribbl.io where players race against the clock to guess what a diffusion model is generating as its output is slowly denoised. I built this with a team of friends for the Spring 2025 Machine Learning at Berkeley Hackathon, where our project won 1st place!",
			"link": "https://guesscasso.onrender.com/",
			"image": "/guesscasso.png",
			"github": "https://github.com/deenasun/guesscasso"
		}
	]
}
